<style type="text/css">
<!--
.Estilo4 {	font-size: 12px;
	color: #FFFFFF;
}
.Estilo5 {color: #FFFFFF}
a:link {
	color: #FFFFFF;
}
a:visited {
	color: #FFFFFF;
}
body {
	background-image: url(Imagenes/bg.jpg);
	background-repeat: no-repeat;
}
-->
</style>
<title>Lecturas</title><div align="center">
  <table width="1117" height="160" border="1">
    <tr>
      <th width="231" scope="col"><img src="Imagenes/Imagen.PNG" width="231" height="174" /></th>
      <th width="611" scope="col"><img src="Imagenes/logo_unad.png" width="555" height="151" /></th>
      <th width="253" scope="col"><a href="https://campus0c.unad.edu.co/campus0/login/index.php"><img src="Imagenes/Campus.PNG" width="211" height="97" border="0" /></a></th>
    </tr>
  </table>
</div>
<div align="center">
  <table width="1117" border="1" bordercolor="#000033">
    <tr>
            <th width="142" height="38" bordercolor="#CCCCCC" bgcolor="#003366" scope="col"><span class="Estilo11"><a href="Index.html">Inicio</a></span></th>
      <th width="238" bgcolor="#003366" scope="col"><span class="Estilo13"><a href="Lecturas.html">Lecturas</a></span></th>
      <th width="190" bgcolor="#003366" scope="col"><span class="Estilo13"><a href="Multimedia.html">Multimedia</a></span></th>
      <th width="250" bgcolor="#003366" scope="col"><span class="Estilo13"><a href="Actividades.Html">Actividades</a></span></th>
	  <th width="263" bgcolor="#003366" scope="col"><span class="Estilo11"><a href="Autor.Html">Autor</a></span></th>
    </tr>
  </table>
  <table width="1116" height="86" border="1">
    <tr>
      <th height="80" scope="col"><p>&nbsp;</p>
        <p>&nbsp;</p>
        <p><strong>P&aacute;gina web</strong><br />
          Es una p&aacute;gina electr&oacute;nica o ciberp&aacute;gina, es un documento o  informaci&oacute;n electr&oacute;nica capaz de contener texto, sonido, v&iacute;deo, programas,  enlaces, im&aacute;genes, y muchas otras cosas, adaptada para la llamada World Wide  Web (WWW) y que puede ser accedida mediante un navegador.</p></th>
    </tr>
  </table>
  <table width="1114" height="289" border="1">
    <tr>
      <th width="553" height="283" scope="col"><p align="left">Introducci&oacute;n</p>
        <p align="left">Bueno antes que todo est&aacute;n las preguntas b&aacute;sicas, &iquest;qu&eacute; es?, &iquest;para qu&eacute; es?, &iquest;En qu&eacute; me beneficio?, y no pueden hacer falta en este mundo del dise&ntilde;o y la estructura web y espec&iacute;ficamente en este tema de HTML5.<br />
          &iquest;Qu&eacute; es html 5?</p>
        <p align="left">&ndash; Simplemente Como su nombre indica, HTML 5 es el sucesor de HTML4. Este trabajo o proyecto de HTML5 se inici&oacute; a finales de 2003 con un grupo de trabajo que se propuso a hacer un lenguaje que llegara con un conjunto de tecnolog&iacute;as que permiten construir la nueva Web. No fue sino hasta 2007 que el HTML5 del W3C acepta la visi&oacute;n mediante la incorporaci&oacute;n en ella del grupo de trabajo. Los principios de dise&ntilde;o son claras: para simplificar el uso de HTML, la formalizaci&oacute;n de las pr&aacute;cticas actuales, y garantizar la m&aacute;xima compatibilidad con versiones anteriores.</p>        
        <p align="left">&nbsp;</p>
      </th>
      <th width="545" scope="col"><p align="left">Podemos agrupar o clasificar todas las p&aacute;ginas webs en 2  grandes grupos:</p>
        <p align="left"><br />
          Las webs est&aacute;ticas son aquellas cuya informaci&oacute;n no var&iacute;a en  un tiempo a medio o a corto plazo, tambi&eacute;n se las reconoce puesto que no  interact&uacute;an con el usuario o navegante, su lenguaje de programaci&oacute;n est&aacute; basado  en HTML y est&aacute;n compuestas principalmente de textos e im&aacute;genes.</p>
        <p align="left">          Las webs din&aacute;micas son aquellas que son capaces de  interactuar con el usuario o navegante dado a que est&aacute;n conectadas con bases de  datos que permiten el desarrollo de aplicaciones webs, su principal ventaja es  la personalizaci&oacute;n de la web en funci&oacute;n del usuario as&iacute; como la rapidez de  modificaci&oacute;n de los contenidos. Este tipo de webs est&aacute;n desarrolladas bajo  lenguajes de programaci&oacute;n como PHP, ASP, JSP o RUBY.</p></th>
    </tr>
  </table>
  <table width="1113" height="329" border="1">
    <tr>
      <th width="553" scope="col"><p align="left">HTML5 </p>
        <p align="left">Es la nueva versi&oacute;n del lenguaje de marcado que se usa  para estructurar p&aacute;ginas web, que actualmente todavia sigue en su evolucion,  gracias a &eacute;l con caracter&iacute;sticas nuevas y modificaciones que mejorar&aacute;  significativamente este nuevo est&aacute;ndar.</p>
        <p align="left"><br />
  &iquest;Para que sirve ? </p>
        <p align="left">En primer lugar, el HTML 4 se utiliza para  estructurar un documento. El html5 no cambia este objetivo, solo que tendremos  la oportunidad de hacer las cosas m&aacute;s de una manera m&aacute;s  sencilla. Eso no es todo, ahora podemos crear aplicaciones web de una manera menos  complicada ya que esta tecnolog&iacute;a mejora e incorpora muchos conceptos de  programaci&oacute;n web, como decir un todo en uno.</p>
      </th>
      <th width="544" scope="col"><p align="left">&iquest;Porqu&eacute;  es mejor HTML5?</p>
      <p align="left"> Esta es una pregunta muy importante que no requiere una c&aacute;tedra  para dar una respuesta, Simplemente porque es una tecnolog&iacute;a que supera a la  actual HTML, porque es lo nuevo que estandariza la W3C, porque es nueva  tecnolog&iacute;a y como toda nueva tecnolog&iacute;a siempre viene con cosas que nos van a  impresionar, porque llega de la mano de CSS3, una evoluci&oacute;n notable de las  hojas de estilo que conoc&iacute;amos y porque revaloriza el papel de JavaScript en la  Web, como el lenguaje que &ldquo;sabe hablar&rdquo; con las nuevas Apis que llegan con  HTML5.</p>
      <p align="left">&iquest;Por  qu&eacute; debo de comenzar a trabajar con HTML5?, </p>
      <p align="left">La respuesta es muy corta: debes de  comenzar a crear tus proyectos en HTML5 porque es una inversi&oacute;n en el futuro,  &iexcl;&iexcl; NO que digo futuro!! es para &iexcl;&iexcl;YA...!!., la mayor&iacute;a de los sitios web  poderosos del mundo ya implementan este est&aacute;ndar, y si no quieres quedarte atr&aacute;s,  debes de comenzar ya.</p></th>
    </tr>
  </table>
  <table width="1114" height="145" border="1">
    <tr>
      <th width="554" scope="col"><p align="left">&iquest;Qu&eacute; hay de nuevo entonces en html5?</p>
        <p align="left">Hay muchas mejoras y cosas nuevas que nos pueden sorprender  por ejemplo el tema de formularios, la forma de estructuraci&oacute;n en fin&hellip;</p>
      <p align="left">A continuaci&oacute;n alguna de las reglas establecidas para HTML5:</p></th>
      <th width="544" scope="col"><ul>
        <li>
          <div align="left">La nueva caracter&iacute;stica debe basarse en HTML,  CSS, DOM y JavaScript.</div>
        </li>
        <li>
          <div align="left">Reducir la necesidad de plugins externos (como  Flash). </div>
        </li>
        <li>
          <div align="left">Mejor manejo de errores.</div>
        </li>
        <li>
          <div align="left">M&aacute;s marcado para reemplazar secuencias de  comandos.</div>
        </li>
        <li>
          <div align="left">HTML5 debe ser independiente del dispositivo.</div>
        </li>
        <li>
          <div align="left">El proceso de desarrollo debe ser visible para  el p&uacute;blico.</div>
        </li>
      </ul>      </th>
    </tr>
  </table>
  </div>
<div align="center">
  <table width="1116" border="1" bordercolor="#003366" bgcolor="#003366">
    <tr>
      <th width="1106" scope="col"><p class="Estilo4"><strong><strong>Instituci&oacute;n de Educaci&oacute;n Superior sujeta a inspecci&oacute;n y vigilancia por el Ministerio de Educaci&oacute;n Nacional</strong></strong></p>
          <p><span class="Estilo4"><strong>&Uacute;ltima actualizaci&oacute;n ( 2016-09-15 ) &copy; Copyright UNAD 2016&nbsp; - Powered by</strong></span><strong>&nbsp;<a href="http://www.joomla.org/">Joomla</a><span class="Estilo5">&nbsp;(</span>&nbsp;<a href="http://informacion.unad.edu.co/informacion-al-ciudadano">Atenci&oacute;n al usuario</a>&nbsp;<span class="Estilo5">)</span> <span class="Estilo5">(</span>&nbsp;<a href="http://informacion.unad.edu.co/politica-de-privacidad/">Pol&iacute;tica de privacidad</a>&nbsp;<span class="Estilo5">)</span> <span class="Estilo5">(</span>&nbsp;<a href="http://informacion.unad.edu.co/mapa-del-sitio">Mapa del sitio</a>&nbsp;<span class="Estilo5">)</span></strong></p></th>
    </tr>
  </table>
</div>
<p>&nbsp;</p>
